CSI API ETABS v1
cLineElm.GetInsertionPoint Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetInsertionPoint(
	string Name,
	ref double[] Offset1,
	ref double[] Offset2
)
Function GetInsertionPoint (
	Name As String,
	ByRef Offset1 As Double(),
	ByRef Offset2 As Double()
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim Offset1 As Double()
Dim Offset2 As Double()
Dim returnValue As Integer
returnValue = instance.GetInsertionPoint(Name,
	Offset1, Offset2)
int GetInsertionPoint(
	String^ Name,
	array<double>^% Offset1,
	array<double>^% Offset2
)
abstract GetInsertionPoint :
        Name : string *
        Offset1 : float[] byref *
        Offset2 : float[] byref -> int
Parameters
Name
Type: System.String
Offset1
Type: System.Double[]
Offset2
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace